experiment-finetuned/all_finetuned/runs/squareBend/3/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    // Block 0 - inlet straight section
    (-50  25  25)   // 0
    (-50  25 -25)   // 1
    (-50 -25 -25)   // 2
    (-50 -25  25)   // 3
    ( 25  25  25)   // 4
    ( 25  25 -25)   // 5
    ( 25 -25 -25)   // 6
    ( 25 -25  25)   // 7

    // Block 1 - bend section
    ( 25 -75  25)   // 8
    ( 25 -75 -25)   // 9
    ( 25 -175 -25)  // 10
    ( 25 -175  25)  // 11

    // Block 2 - outlet straight section
    (-500 -175  25) // 12
    (-500 -175 -25) // 13
    (-500 -225 -25) // 14
    (-500 -225  25) // 15
);

blocks
(
    hex (0 3 2 1 4 7 6 5) (20 10 10) simpleGrading (1 1 1)
    hex (4 7 6 5 8 11 10 9) (10 10 10) simpleGrading (1 1 1)
    hex (8 12 15 11 9 13 14 10) (20 10 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (12 15 14 13)
        );
    }
    innerWall
    {
        type wall;
        faces
        (
            (4 7 6 5)
            (8 11 10 9)
            (8 12 15 11)
        );
    }
    outerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
            (4 7 6 5)
            (5 9 10 6)
            (12 13 14 15)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (1 5 6 2)
            (4 7 6 5)
            (5 9 10 6)
            (8 12 15 11)
            (9 13 14 10)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 2 6 7)
            (4 5 9 8)
            (7 6 10 11)
            (8 9 13 12)
            (11 10 14 15)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //