experiment-finetuned/all_finetuned/runs/squareBend/3/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        massFlowRate    0.5;
        profile         turbulentBL;
        value           uniform (0 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    innerWall
    {
        type            noSlip;
    }

    outerWall
    {
        type            noSlip;
    }

    lowerWall
    {
        type            noSlip;
    }

    upperWall
    {
        type            noSlip;
    }
}

// ************************************************************************* //