experiment-finetuned/all_finetuned/runs/squareBend/3/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 110000;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 110000;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 110000;
        value           uniform 110000;
    }

    innerWall
    {
        type            zeroGradient;
    }

    outerWall
    {
        type            zeroGradient;
    }

    lowerWall
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            zeroGradient;
    }

    leftWall
    {
        type            zeroGradient;
        value           uniform 110000;
    }

    rightWall
    {
        type            zeroGradient;
        value           uniform 110000;
    }
}

// ************************************************************************* //