experiment-finetuned/all_finetuned/runs/squareBend/3/0/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1000;
    }

    outlet
    {
        type            zeroGradient;
    }

    innerWall
    {
        type            zeroGradient;
    }

    outerWall
    {
        type            zeroGradient;
    }

    lowerWall
    {
        type            zeroGradient;
    }

    upperWall
    {
        type            zeroGradient;
    }

    leftWall
    {
        type            zeroGradient;
        value           uniform 300;
    }

    rightWall
    {
        type            zeroGradient;
        value           uniform 300;
    }
}

// ************************************************************************* //