experiment-finetuned/all_finetuned/runs/squareBend/3/0/alphat
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    innerWall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    outerWall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    lowerWall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    upperWall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    leftWall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }

    rightWall
    {
        type            compressible::alphatWallFunction;
        value           uniform 0;
    }
}

// ************************************************************************* //