experiment-finetuned/all_finetuned/runs/squareBend/3/system/fvConstraints
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

fvConstraints
{
}

// ************************************************************************* //